import { CSSProperties } from "react";

const CHRIS = [
  " ▄████████    ▄█    █▄       ▄████████  ▄█     ▄████████ ",
  "███    ███   ███    ███     ███    ███ ███    ███    ███ ",
  "███    █▀    ███    ███     ███    ███ ███▌   ███    █▀  ",
  "███         ▄███▄▄▄▄███▄▄  ▄███▄▄▄▄██▀ ███▌   ███        ",
  "███        ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀▀▀   ███▌ ▀███████████ ",
  "███    █▄    ███    ███   ▀███████████ ███           ███ ",
  "███    ███   ███    ███     ███    ███ ███     ▄█    ███ ",
  "████████▀    ███    █▀      ███    ███ █▀    ▄████████▀  ",
  "                            ███    ███                   ",
];

export default function Which() {
  return (
    <pre style={styles.text}>
      {CHRIS.map((x: string, i: number) => {
        return (
          <div key={i} style={styles.text}>
            {x}
          </div>
        )
      })}
    </pre>
  )
}

const styles: Record<string, CSSProperties> = {
  text: {
    fontFamily: "monospace",
    letterSpacing: "0px",
    color: "#00ff41",
  }
}
