import { CSSProperties } from "react";

const CHRIS = `
   ▄████████    ▄█    █▄       ▄████████  ▄█     ▄████████ 
  ███    ███   ███    ███     ███    ███ ███    ███    ███ 
  ███    █▀    ███    ███     ███    ███ ███▌   ███    █▀  
  ███         ▄███▄▄▄▄███▄▄  ▄███▄▄▄▄██▀ ███▌   ███        
  ███        ▀▀███▀▀▀▀███▀  ▀▀███▀▀▀▀▀   ███▌ ▀███████████ 
  ███    █▄    ███    ███   ▀███████████ ███           ███ 
  ███    ███   ███    ███     ███    ███ ███     ▄█    ███ 
  ████████▀    ███    █▀      ███    ███ █▀    ▄████████▀  
                              ███    ███                   
`;

export default function Which() {
  return <pre style={styles.text}>{CHRIS}</pre>;
}

const styles: Record<string, CSSProperties> = {
  text: {
    fontFamily: "monospace",
    letterSpacing: "0px",
    color: "#00ff41",
    fontSize: "12px",
    lineHeight: "12px",
  },
};
